/*====================================================================================
    EVS Codec 3GPP TS26.443 Oct 20, 2015. Version 12.4.0
  ====================================================================================*/

#ifndef STAT_DEC_H
#define STAT_DEC_H

#include "options.h"
#include "stat_com.h"          /* Common structures                      */
#include "cnst.h"

typedef enum _DEC_MODE
{
    DEC_NO_FRAM_LOSS         = 0x0,
    DEC_CONCEALMENT_EXT      = 0x1
} DEC_MODE;

typedef enum
{
    FRAMEMODE_NORMAL        = 0x0,   /**< frame available            */
    FRAMEMODE_MISSING       = 0x1,   /**< frame missing => conceal   */
    FRAMEMODE_FUTURE        = 0x2
} frameMode;


/* Arrays and variables specific to decoder */
typedef struct
{
    HANDLE_FD_CNG_COM hFdCngCom;

    float   msPeriodog[NPART_SHAPING]; /* Periodogram */
    float   msBminWin[NPART_SHAPING];
    float   msBminSubWin[NPART_SHAPING];
    float   msPsd[NPART_SHAPING];          /* Power Spectral Density estimate (i.e., smoothed periodogram) */
    float   msAlpha[NPART_SHAPING];        /* Optimal smoothing parameter */
    float   msMinBuf[MSNUMSUBFR*NPART_SHAPING];       /* Buffer of minima */
    float   msCurrentMinOut[NPART_SHAPING];
    float   msCurrentMin[NPART_SHAPING];
    float   msCurrentMinSubWindow[NPART_SHAPING];
    int     msLocalMinFlag[NPART_SHAPING];
    int     msNewMinFlag[NPART_SHAPING];
    float   msPsdFirstMoment[NPART_SHAPING];
    float   msPsdSecondMoment[NPART_SHAPING];
    float   msNoiseFloor[NPART_SHAPING];   /* Estimated noise floor */
    float   msNoiseEst[NPART_SHAPING];     /* Estimated noise level */
    float   msLogPeriodog[NPART_SHAPING]; /* Periodogram */
    float   msLogNoiseEst[NPART_SHAPING]; /* Estimated noise level */
    int     npart_shaping;          /* Number of partitions */
    int     nFFTpart_shaping;       /* Number of hybrid spectral partitions */
    int     part_shaping[NPART_SHAPING];           /* Partition upper boundaries (band indices starting from 0) */
    int     midband_shaping[NPART_SHAPING];        /* Central band of each partition */
    float   psize_shaping[NPART_SHAPING];          /* Partition sizes */
    float   psize_inv_shaping[NPART_SHAPING];      /* Inverse of partition sizes */
    float   bandNoiseShape[FFTLEN2];/* CNG spectral shape computed at the decoder */
    float   partNoiseShape[NPART];/* CNG spectral shape computed at the decoder */

    short   flag_dtx_mode;
    float   lp_speech;
    float   lp_noise;

    float   msPeriodogBuf[MSBUFLEN*NPART_SHAPING];
    int     msPeriodogBufPtr;

}
FD_CNG_DEC;
typedef FD_CNG_DEC *HANDLE_FD_CNG_DEC;

typedef struct
{
    int FrameSize;

    int Pitch;
    int T_bfi;

    int Transient[MAX_POST_LEN];
    int TCX_Tonality[DEC_STATE_LEN];

    float outx_new_n1;
    float nsapp_gain;
    float nsapp_gain_n;
    float data_reci2[L_FRAME_MAX];
    float data_noise[L_FRAME_MAX];
    float ener_mean;
    float ener;
    int zp;
    float recovery_gain;
    float step_concealgain;

    int concealment_method;
    int subframe;
    int nbLostCmpt;

    short seed;

} T_PLCInfo;


/*---------------------------------------------------------------*
 * Structures for Tonal MDCT PLC                                 *
 *---------------------------------------------------------------*/

typedef enum
{
    TONALMDCTCONCEAL_OK = 0,

    __error_codes_start = -100,

    TONALMDCTCONCEAL_NSAMPLES_LARGER_THAN_MAXBLOCKSIZE,
    TONALMDCTCONCEAL_INVALIDPOINTER,
    TONALMDCTCONCEAL_UNEXPECTED_ERROR,

    __error_codes_end
} TONALMDCTCONCEAL_ERROR;

typedef struct
{
    unsigned int nSamples;
    unsigned int nSamplesCore;
    Float32 * spectralData;
    float * scaleFactors;
    int blockIsValid;
    int blockIsConcealed;
    int tonalConcealmentActive;
} blockData;

typedef struct
{
    unsigned int numIndexes;
    unsigned short int indexOfTonalPeak[MAX_NUMBER_OF_IDX];
    unsigned short int lowerIndex[MAX_NUMBER_OF_IDX];
    unsigned short int upperIndex[MAX_NUMBER_OF_IDX];
    Float32 phaseDiff[MAX_NUMBER_OF_IDX]; /* This one can be stored with 16 bits in range 0..2*PI */
    Float32 phase_currentFramePredicted[MAX_NUMBER_OF_IDX*GROUP_LENGTH]; /* This one can be stored with 16 bits in range 0..2*PI, but the code has to be adapted to use moduo(2*PI) after adding */
} TonalComponentsInfo;

typedef void (*ApplyScaleFactorsPointer)(float x[], int lg, float const scaleFactors[]);

struct tonalmdctconceal
{
    TCX_config * tcx_cfg;
    void * pMDSTData;
    unsigned int nSamples;
    unsigned int nSamplesCore;
    unsigned int nNonZeroSamples;
    unsigned int nScaleFactors;

    float lastPitchLag;

    blockData lastBlockData;
    blockData secondLastBlockData;

    Float32 scaleFactorsBuffers[2][FDNS_NPTS]; /* Contains also global gain. If it can not be stored in 16 bits with global gain included, then store global gain separately. */
    Float32 spectralDataBuffers[2][L_FRAME_MAX]; /* 16 bits is enough, because it is stored before applying scale factors. Take care that power spectrum is also stored here. */
    Float32 timeDataBuffer[(3*L_FRAME_MAX)/2];
    Float32 * lastPcmOut;
    Float32 * secondLastPcmOut;
    float * secondLastPowerSpectrum;

    float nFramesLost;

    TonalComponentsInfo * pTCI;
};

typedef struct tonalmdctconceal* TonalMDCTConcealPtr;

typedef enum SIGNAL_CLASSIFER_MODE
{
    CLASSIFIER_ACELP,
    CLASSIFIER_TCX
} SIGNAL_CLASSIFIER_MODE;

/*---------------------------------------------------------------*
 * Structures for IGF decoder                                    *
 *---------------------------------------------------------------*/

/* IGFSCFDecoder.h */
typedef struct
{
    int               bitsRead;  /* after a call bitsRead contains the number of bits consumed by the decoder */
    int               prev[64];  /* no more than 64 SCFs for the IGF energy envelope of one block */
    int               scfCountLongBlock;
    int               t;
    int               bitrate;
    const unsigned short   *cf_se00;
    const unsigned short   *cf_se01;
    short                   cf_off_se01;
    const unsigned short   *cf_se02;
    const short            *cf_off_se02;
    const unsigned short   *cf_se10;
    short                   cf_off_se10;
    const unsigned short   *cf_se11;
    const short            *cf_off_se11;
    Tastat            acState;
} IGFSCFDEC_INSTANCE, *IGFSCFDEC_INSTANCE_HANDLE;

/* IGFDec.h */
typedef struct igfdec_private_data_struct
{

    IGF_INFO                  igfInfo;
    /* envelope reconstruction: */
    float                     igf_sN[IGF_MAX_SFB];                     /* only with short blocks as static needed */
    float                     igf_pN[IGF_MAX_SFB];                     /* only with short blocks as static needed */
    int                       igf_curr[IGF_MAX_SFB];                   /* current igf energies */
    int                       igf_prev[IGF_MAX_SFB];                   /* needed for concealment or indepflag==0 */
    int                       igf_curr_subframe[IGF_MAX_SUBFRAMES][IGF_TRANS_FAK][IGF_MAX_SFB];    /* current igf energies per subframe*/
    int                       igf_prev_subframe[IGF_MAX_SUBFRAMES][IGF_MAX_SFB];                   /* needed for concealment or indepflag==0 */
    int                       igf_flatteningTrigger_subframe[IGF_MAX_SUBFRAMES];

    /* spectral whitening: */
    float                     pSpecFlat[IGF_START_MX];
    int                       currWhiteningLevel[IGF_MAX_TILES];
    int                       prevWhiteningLevel[IGF_MAX_TILES];                                /* needed for concealment */
    int                       currWhiteningLevel_subframe[IGF_MAX_SUBFRAMES][IGF_MAX_TILES];
    int                       prevWhiteningLevel_subframe[IGF_MAX_SUBFRAMES][IGF_MAX_TILES];    /* needed for concealment */

    float                     totalNoiseNrg;
    int                       n_noise_bands;

    float                     totalNoiseNrg_off;
    int                       n_noise_bands_off;

    /* IGF SCF decoding: */
    IGFSCFDEC_INSTANCE        hArithSCFdec;

    /* concealment: */
    int                       frameLossCounter;

} IGFDEC_PRIVATE_DATA,*IGF_DEC_PRIVATE_DATA_HANDLE;

typedef struct igfdec_instance_struct
{
    int             isIGFActive;
    int             infoIGFAllZero;
    int             infoIGFStopLine;
    int             infoIGFStartLine;
    int             infoIGFStopFreq;
    int             infoIGFStartFreq;
    unsigned char   infoTCXNoise[IGF_START_MX];
    int             flag_sparse[N_MAX_TCX-IGF_START_MN];
    float           virtualSpec[N_MAX_TCX-IGF_START_MN];
    int             flatteningTrigger;
    IGFDEC_PRIVATE_DATA igfData;
} IGFDEC_INSTANCE, *IGF_DEC_INSTANCE_HANDLE;

/*----------------------------------------------------------------------------------*
 *
 * Main decoder structure
 *
 *----------------------------------------------------------------------------------*/

typedef struct Decoder_State
{

    /*----------------------------------------------------------------------------------*
     * Common parameters
     *----------------------------------------------------------------------------------*/

    short codec_mode;                                   /* Mode 1 or 2 */
    short mdct_sw_enable;                               /* MDCT switching enable flag */
    short mdct_sw;                                      /* MDCT switching indicator */
    short last_codec_mode;                              /* last used codec mode */

    unsigned short bit_stream[MAX_BITS_PER_FRAME+16];
    short next_bit_pos;                                 /* position of the next bit to be read from the bitstream */
    short bitstreamformat;                              /* Bitstream format flag (G.192/MIME) */
    short amrwb_rfc4867_flag;                           /* MIME from rfc4867 is used */
    short BER_detect;                                   /* flag to signal detected bit error in the bitstream */
    int   output_Fs;                                    /* output sampling rate */
    long  total_brate;                                  /* total bitrate in kbps of the codec */
    long  last_total_brate;                             /* last total bitrate in kbps of the codec */
    short core;                                         /* core (ACELP_CORE, TCX_20_CORE, TCX_10_CORE, HQ_CORE, AMR_WB_CORE) */
    long  core_brate;                                   /* core bitrate */
    long  last_core_brate;                              /* previous frame core bitrate */
    short extl;                                         /* extension layer */
    short last_extl;                                    /* previous extension layer */
    long  extl_brate;                                   /* extension layer bitrate */
    short L_frame;                                      /* ACELP core internal frame length */
    short bwidth;                                       /* encoded signal bandwidth */
    short Opt_AMR_WB;                                   /* flag indicating AMR-WB IO mode */
    short Opt_VOIP;                                     /* flag indicating VOIP mode with JBM */
    short ini_frame;                                    /* initialization frames counter */
    Word16 CNG;                                      /* RXDTX handler: CNG=1, nonCNG=0 */
    Word16 prev_ft_speech;                           /* RXDTX handler: previous frametype flag for  G.192 format AMRWB SID_FIRST detection */

    /*----------------------------------------------------------------------------------*
     * ACELP core parameters
     *----------------------------------------------------------------------------------*/

    float old_exc[L_EXC_MEM_DEC];                       /* old excitation */
    float old_excFB[L_FRAME48k];                        /* old excitation FB */
    float lsp_old[M];                                   /* old LSP vector at the end of the frame */
    float lsf_old[M];                                   /* old LSF vector at the end of the frame */
    unsigned int offset_scale1[MAX_NO_MODES+1][MAX_NO_SCALES+1]; /* offsets for LSF LVQ structure 1st 8-dim subvector*/
    unsigned int offset_scale2[MAX_NO_MODES+1][MAX_NO_SCALES+1]; /* offsets for LSF LVQ structure 2nd 8-dim subvector*/
    unsigned int offset_scale1_p[MAX_NO_MODES_p+1][MAX_NO_SCALES+1]; /* offsets for LSF LVQ structure, pred. case, 1st 8-dim subvector*/
    unsigned int offset_scale2_p[MAX_NO_MODES_p+1][MAX_NO_SCALES+1]; /* offsets for LSF LVQ structure, pred. case, 2nd 8-dim subvector*/
    short no_scales[MAX_NO_MODES][2];                     /* LSF LVQ structure */
    short no_scales_p[MAX_NO_MODES_p][2];                 /* LSF LVQ structure */
    float tilt_code;                                    /* tilt of code */
    float mem_syn1[M];                                  /* synthesis filter memory (for core switching and FD BWE) */
    float mem_syn2[M];                                  /* synthesis filter memory */
    float mem_syn3[M];
    float mem_deemph;                                   /* deemphasis filter memory */
    float mem_hp20_out[4];                              /* HP filter memory for synthesis */
    float mem_AR[M];                                    /* AR memory of LSF quantizer (past quantized LSFs without mean) */
    float mem_MA[M];                                    /* MA memory of LSF quantizer (past quantized residual) */
    float stab_fac;                                     /* LSF stability factor */
    float stab_fac_smooth;                              /* low-pass filtered stability factor */
    short last_coder_type;                              /* previous coder type */
    float agc_mem2[2];                                   /* memory of AGC for saturation control */
    float past_qua_en[GAIN_PRED_ORDER];                 /* gain quantization memory (used also in AMR-WB IO mode) */
    short mid_lsf_int;
    short safety_net;

    short seed_tcx ;                                    /* AC mode (GSC) - seed for noise fill*/
    short GSC_noisy_speech;                             /* AC mode (GSC) - flag to indicate GSC osn SWB noisy speech */
    short Last_GSC_noisy_speech_flag;                   /* AC mode (GSC) - mem of the past flag to indicate GSC osn SWB noisy speech */
    short cor_strong_limit;                             /* AC mode (GSC) - Indicator about high spectral correlation per band */
    float old_y_gain[MBANDS_GN];                        /* AC mode (GSC) - AR mem for low rate gain quantization  */
    short noise_lev;                                    /* AC mode (GSC) - noise level                             */
    float lt_ener_per_band[MBANDS_GN];
    float Last_frame_ener;                              /* AC mode (GSC) - last frame energy  */
    float Last_GSC_spectrum[L_FRAME];                   /* AC mode (GSC) - Last good GSC spectrum */
    short Last_GSC_pit_band_idx;                        /* AC mode (GSC) - Last pitch band index */
    float last_exc_dct_in[L_FRAME];                     /* AC mode (GSC) - previous excitation                        */
    float last_ener;                                    /* AC mode (GSC) - previous energy                           */
    short last_bitallocation_band[6];                   /* AC mode (GSC) - previous bit allocation of each band      */

    float gc_threshold;                                 /* Noise enhancer - threshold for gain_code */
    float dispMem[8];                                   /* Noise enhancer - phase dispersion algorithm memory */

    float prev_r;                                       /* HF BWE - previous sub-frame gain                */
    float fmerit_w_sm;                                  /* HF BWE - fmerit parameter memory */
    short frame_count;                                  /* HF BWE - frame count             */
    float ne_min;                                       /* HF BWE - minimum Noise gate - short-term energy */
    float fmerit_m_sm;                                  /* HF BWE - memory of fmerit_m param               */
    float voice_fac_amr_wb_hf;                          /* HF BWE - voice factor                           */
    float unvoicing;                                    /* HF BWE - unvoiced parameter                     */
    float unvoicing_sm;                                 /* HF BWE - smoothed unvoiced parameter            */
    short unvoicing_flag;                               /* HF BWE - unvoiced flag                          */
    short voicing_flag;                                 /* HF BWE - voiced flag                            */
    short start_band_old;                               /* HF BWE - previous start point for copying frequency band */
    float OptCrit_old;                                  /* HF BWE - previous criterion value for deciding the start point */

    short seed2;                                        /* HF (6-7kHz) BWE - seed for random signal generator */
    float mem_hp400[4];                                 /* HF (6-7kHz) BWE - hp400 filter memory */
    float mem_hf[(L_FIR-1)];                            /* HF (6-7kHz) BWE - band-pass filter memory */
    float mem_syn_hf[M];                                /* HF (6-7kHz) BWE - synthesis filter memory */
    float delay_syn_hf[NS2SA(16000,DELAY_CLDFB_NS)];      /* HF (6-7kHz) BWE - To synchronise BWE content with postfiltered synthesis */
    float mem_hp_interp[INTERP_3_1_MEM_LEN];            /* HF (6-7 kHz) BWE - interp. memory */

    short unv_cnt;                                      /* Stationary noise UV modification - unvoiced frame counter */
    short uv_count;                                     /* Stationary noise UV modification - unvoiced counter */
    short act_count;                                    /* Stationary noise UV modification - activation counter */
    float ge_sm;                                        /* Stationary noise UV modification - smoothed excitation gain */
    float lspold_s[M];                                  /* Stationary noise UV modification - old LSP vector */
    short noimix_seed;                                  /* Stationary noise UV modification - mixture seed */
    float min_alpha;                                    /* Stationary noise UV modification - minimum alpha */
    float exc_pe;                                       /* Stationary noise UV modification - memory of the preemphasis filter */

    short bfi;                                          /* FEC - bad frame indicator */
    short prev_bfi;                                     /* FEC - previous bad frame indicator */
    short prev_old_bfi;                                 /* FEC - previous old bad frame indicator */
    short seed;                                         /* FEC - seed for random generator for excitation */
    float lp_ener_bfi;                                  /* FEC - long-term active-signal average energy */
    short last_good;                                    /* FEC - clas of last good received */
    float lp_gainp;                                     /* FEC - low-pass filtered pitch gain */
    float lp_gainc;                                     /* FEC - low-pass filtered code gain */
    float lp_ener;                                      /* FEC - low-pass filtered energy */
    float enr_old;                                      /* FEC - energy of the concealed frame */
    float bfi_pitch;                                    /* FEC - pitch for FEC */
    short bfi_pitch_frame;                              /* FEC - frame length when pitch for FEC is saved */
    float old_pitch_buf[2*NB_SUBFR16k+2];               /* FEC - buffer of old subframe pitch values */
    short upd_cnt;                                      /* FEC - counter of frames since last update */
    short scaling_flag;                                 /* FEC - flag to indicate energy control of syn  */
    float lp_ener_FEC_av;                               /* FEC - averaged voiced signal energy           */
    float lp_ener_FEC_max;                              /* FEC - averaged voiced signal energy           */
    float old_enr_LP;                                   /* FEC - LP filter gain */
    short prev_nbLostCmpt;                              /* FEC - compt for number of consecutive lost frame at the previous frame*/
    short mode_lvq;                                     /* FEC - index for LSF mean vector */
    float lsfoldbfi0[M];                                /* FEC - LSF vector of the previous frame */
    float lsfoldbfi1[M];                                /* FEC - LSF vector of the past previous frame */
    float lsf_adaptive_mean[M];                         /* FEC - adaptive mean LSF vector for FEC */
    short decision_hyst;                                /* FEC - hysteresis of the music/speech decision */
    float old_exc2[L_EXC_MEM];                          /* FEC - old excitation2 used in fast recovery */
    float old_syn2[L_EXC_MEM];                          /* FEC - old syn speech used in fast recovery */
    short relax_prev_lsf_interp;
    float mem_syn_clas_estim[L_SYN_MEM_CLAS_ESTIM];     /* FEC - memory of the synthesis signal for frame class estimation */
    float tilt_swb_fec;                                 /* FEC - SWB TBE TILT */

    short cng_seed;                                     /* DTX/CNG - seed for white noise random generator */
    float lspCNG[M];                                    /* DTX/CNG - LP filtered ISPs */
    short first_CNG;                                    /* DTX/CNG - first CNG frame flag */
    float Enew;                                         /* DTX/CNG - decoded residual energy */
    short old_enr_index;                                /* DTX/CNG - index of last encoded CNG energy */
    short cng_ener_seed;                                /* DTX/CNG - seed for random generator for variation of excitation energy */
    short cng_ener_seed1;
    short last_allow_cn_step;
    short ho_hist_size;                                 /* DTX/CNG - size of DTX hangover history buffer for averaging, <0,HO_HIST_SIZE> */
